import { ScrollView, StyleSheet, Text, View } from "react-native";
import React from "react";

const PaidalyNev = () => {
  return (
    <ScrollView>
      <View style={styles.container}>
        <Text style={styles.text}>
        Қазақ кинематографиясында комедия жанрында да көптеген қызықты және көңілді фильмдер бар. Міне, кейбір танымал қазақ комедиялары:

### 1. **Бизнес по-казахски**
Бұл фильмде ауылдан қалаға келген басты кейіпкердің өмірі туралы айтылады. Ол бизнес жасауға тырысады, бірақ қала өмірінің қиындықтарымен бетпе-бет келіп, көптеген күлкілі жағдайларға тап болады.

### 2. **Қыз жолы**
Фильмде дәстүрлі қазақ тойы барысында орын алатын күлкілі және қызықты жағдайлар көрсетіледі. Той дайындығы, туыстар арасындағы қарым-қатынас және той күніндегі қызықтар - барлығы да комедиялық формада беріледі.

### 3. **Келинка Сабина**
Фильмде ауылдан қалаға келген Сабина есімді қыздың өмірі туралы айтылады. Ол қала өміріне үйренуге тырысып, көптеген күлкілі жағдайларға тап болады. Бұл фильмде қалалық және ауылдық өмірдің айырмашылықтары мен қиындықтары көрсетіледі.

### 4. **Шабдалы**
Бұл фильмде қазақтың ауыл өміріндегі қызықты жағдайлар мен күлкілі оқиғалар туралы айтылады. Басты кейіпкердің өміріндегі қиындықтары мен қуаныштары, ауылдық адамдардың ерекше мінез-құлықтары күлкілі түрде көрсетіледі.

### 5. **Махаббат қызық мол жылдар**
Фильмде студенттік өмірдегі махаббат хикаялары, достық және көңілді оқиғалар көрсетіледі. Фильм студенттердің өміріндегі қызықты және күлкілі жағдайларды бейнелейді.

### 6. **Бизнес по-казахски в Америке**
Фильмнің жалғасы ретінде, басты кейіпкер Америкаға барады және онда өзінің бизнесін дамытуды көздейді. Шетелде орын алатын күлкілі жағдайлар мен қызықты оқиғалар фильмнің негізгі сюжеті болып табылады.

### 7. **Брат или Брак**
Фильмде екі жігіттің бір қызға ғашық болуы және олардың арасындағы күлкілі жағдайлар туралы айтылады. Бұл фильм достық, махаббат және отбасы құндылықтары туралы комедиялық хикая.

### 8. **Адель**
Фильмде ауылда өскен басты кейіпкер Адельдің қала өміріне үйренуге тырысуы және оның барысында кездесетін күлкілі жағдайлар туралы айтылады.

Бұл фильмдер қазақ өмірінің әртүрлі қырларын күлкілі түрде көрсетіп, көрермендерді көңілдендіреді.
        </Text>
      </View>
    </ScrollView>
  );
};

export default PaidalyNev;

const styles = StyleSheet.create({
  container: {
    backgroundColor: "#f0f0f0",
    borderRadius: 10,
    padding: 20,
    margin: 10,
    shadowColor: "#000",
    shadowOffset: {
      width: 0,
      height: 2,
    },
    shadowOpacity: 0.25,
    shadowRadius: 3.84,
    elevation: 5,
  },
  text: {
    fontSize: 20,
    fontWeight: "app-Semi",
  },
});
