import { StyleSheet, Text, View, ScrollView } from "react-native";
import React from "react";

const PaidalyKar = () => {
  return (
    <ScrollView>
      <View style={styles.container}>
        <Text style={styles.text}>
          Қазақ кинематографиясында драма жанрында да көптеген терең мағыналы,
          әсерлі фильмдер бар. Бұл фильмдерде өмірдің қиындықтары, махаббат,
          достық, адалдық, және адамның ішкі әлемі туралы терең ойлар қозғалады.
          Міне, кейбір танымал қазақ драмалық фильмдер: ### 1. **Анаға апарар
          жол (Дорога к матери)** Бұл фильмде Ұлы Отан соғысы кезінде анасы мен
          баласының бір-біріне деген сүйіспеншілігі, олардың бір-біріне деген
          сағынышы мен адалдықтары туралы айтылады. Фильмде соғыстың
          ауыртпалықтары, өмірдің қиындықтары мен ана махаббатының күші туралы
          баяндалады. ### 2. **Жаужүрек мың бала** Бұл тарихи драмада XVIII
          ғасырдағы қазақ-жоңғар соғысы кезеңіндегі жас батырлардың ерліктері
          туралы айтылады. Фильмде Отанға деген сүйіспеншілік, ерлік және
          батырлық туралы терең ойлар көрсетіледі. ### 3. **Келін** Фильмде
          таулы ауылда өмір сүретін қазақ отбасының өмірі туралы баяндалады.
          Келіннің ауылдағы өмірі, дәстүрлер мен салт-дәстүрлер арасындағы
          күресі, оның ішкі әлемі мен сезімдері туралы айтылады. Фильмде табиғат
          пен адамның байланысы, дәстүрлер мен қазіргі заманның қайшылықтары
          терең көрсетілген. ### 4. **Шал (Старик)** Бұл фильмде шал мен оның
          немересінің арасындағы қарым-қатынас, олардың табиғатпен және мал
          шаруашылығымен байланысты өмірі туралы айтылады. Фильмде адамның
          табиғатпен байланысы, өмірдің мәні туралы терең ойлар қозғалады. ###
          5. **Рэкетир** Бұл фильмде 1990-жылдардағы Қазақстандағы қиын
          экономикалық жағдайлар мен криминалдық өмір туралы баяндалады. Бас
          кейіпкердің өміріндегі қиындықтары, оның қылмыс әлемімен байланысы мен
          өмірдегі таңдаулары туралы айтылады. ### 6. **Томирис** Бұл тарихи
          драмада ежелгі сақ патшайымы Томиристің өмірі мен ерліктері туралы
          баяндалады. Фильмде оның Патшайым ретіндегі күші, ерлігі және
          тарихтағы рөлі туралы айтылады. ### 7. **Аманат** Бұл фильмде Ұлы Отан
          соғысы кезінде майданға кеткен әкесін іздеген баланың өмірі туралы
          баяндалады. Фильмде соғыс, оның адамдарға әсері және адамның ішкі
          әлемі туралы терең ойлар қозғалады. ### 8. **Қазақ хандығы. Алмас
          қылыш** Бұл тарихи драмада қазақ хандығының құрылу кезеңіндегі
          оқиғалар туралы баяндалады. Фильмде тарихи тұлғалардың ерліктері,
          олардың өмірі мен қазақ хандығының қалыптасуы туралы айтылады. Бұл
          фильмдер қазақ халқының тарихы мен мәдениетін тереңірек түсінуге,
          өмірдің мәні мен адамның ішкі әлемі туралы ойлануға мүмкіндік береді.
        </Text>
      </View>
    </ScrollView>
  );
};

export default PaidalyKar;

const styles = StyleSheet.create({
  container: {
    backgroundColor: "#f0f0f0",
    borderRadius: 10,
    padding: 20,
    margin: 10,
    shadowColor: "#000",
    shadowOffset: {
      width: 0,
      height: 2,
    },
    shadowOpacity: 0.25,
    shadowRadius: 3.84,
    elevation: 5,
  },
  text: {
    fontSize: 20,
    fontWeight: "app-Semi",
  },
});
