import { StyleSheet, Text, View, ScrollView } from "react-native";
import React from "react";

const PaidalyOt = () => {
  return (
    <ScrollView>
      <View style={styles.container}>
        <Text style={styles.text}>
        Қазақ кинематографиясында балаларға арналған көптеген фильмдер мен мультфильмдер бар. Бұл фильмдер балаларға қызықты әрі тәрбиелік мәні зор оқиғаларды ұсынады. Міне, кейбір танымал қазақ балалар фильмдері мен мультфильмдері:

### 1. **Мұзбалақ**
Бұл анимациялық фильмде бүркіт пен оның иесі туралы айтылады. Фильмде адам мен табиғаттың байланысы, достық және адалдық тақырыптары қозғалады. Балаларға арналған қызықты әрі әсерлі фильм.

### 2. **Күлтегін**
Бұл анимациялық фильмде ежелгі түркі қағанатының батырлары туралы айтылады. Күлтегіннің ерліктері, оның елін қорғау жолындағы күресі туралы қызықты оқиғалар көрсетіледі.

### 3. **Қазақ ертегілері**
Бұл сериялы мультфильмдерде қазақ халқының классикалық ертегілері көрсетіледі. Ертегілерде батырлар, жауыздар, ғажайып жануарлар мен құстар туралы қызықты оқиғалар баяндалады.

### 4. **Балапан**
Бұл анимациялық сериал балаларға арналған. Онда балаларға пайдалы ақпараттар, қызықты оқиғалар және қызықты кейіпкерлер бар. Балапан арнасы арқылы көрсетілетін бұл сериал қазақ тілінде білім беру мен тәрбиелеуге бағытталған.

### 5. **Алдар Көсе**
Бұл мультфильмде қазақ халық ертегілерінің кейіпкері Алдар Көсенің ақылдылығы мен тапқырлығы туралы айтылады. Алдардың әртүрлі күлкілі және қызықты оқиғалары балаларға ұнайды.

### 6. **Ер Төстік пен Айдаһар**
Бұл анимациялық фильмде Ер Төстік батырдың Айдаһармен күресі туралы айтылады. Батырлық, адалдық және достық туралы бұл мультфильм балаларға патриоттық рух береді.

### 7. **Тазша бала**
Бұл мультфильмде қазақ халық ертегілерінің кейіпкері Тазша баланың қызықты оқиғалары баяндалады. Оның тапқырлығы мен күлкілі жағдайлары балаларға қызықты.

### 8. **Аңыздар кітабы: Құмсағат құпиясы**
Бұл фильмде балалардың уақыт машинасын тауып, өткенге сапар шегуі туралы айтылады. Олар әртүрлі тарихи кезеңдерге барып, қызықты оқиғаларға тап болады.

Бұл фильмдер мен мультфильмдер балаларға қазақ халқының тарихы мен мәдениетін таныстырады, оларға тәрбие беріп, көңілді және қызықты уақыт өткізуге мүмкіндік береді.
        </Text>
      </View>
    </ScrollView>
  );
};

export default PaidalyOt;

const styles = StyleSheet.create({
  container: {
    backgroundColor: "#f0f0f0",
    borderRadius: 10,
    padding: 20,
    margin: 10,
    shadowColor: "#000",
    shadowOffset: {
      width: 0,
      height: 2,
    },
    shadowOpacity: 0.25,
    shadowRadius: 3.84,
    elevation: 5,
  },
  text: {
    fontSize: 20,
    fontWeight: "app-Semi",
  },
});
